[Killed] ConditionalExpression
src/app/interceptors/api-key.interceptor.ts:5:7
 import { environment } from "src/environments/environment";
 
 export const apiKeyInterceptor: HttpInterceptorFn = (req, next) => {
-  if (!req.url.includes("api.weatherstack.com")) {
+  if (false) {
     return next(req);
   }
killedBy: apiKeyInterceptor does NOT add access_key to unrelated URLs
statusReason: Expected true to be false.

[Killed] BooleanLiteral
src/app/interceptors/api-key.interceptor.ts:5:7
 import { environment } from "src/environments/environment";
 
 export const apiKeyInterceptor: HttpInterceptorFn = (req, next) => {
-  if (!req.url.includes("api.weatherstack.com")) {
+  if (req.url.includes("api.weatherstack.com")) {
     return next(req);
   }
killedBy: apiKeyInterceptor adds access_key param to weatherstack requests
statusReason: Error: Expected one matching request for criteria "Match by function: ", found none. Requests received are: GET http://api.weatherstack.com/current?query=42,21.

[Killed] ObjectLiteral
src/app/interceptors/api-key.interceptor.ts:9:28
     return next(req);
   }
 
-  const cloned = req.clone({
-    setParams: {
-      access_key: environment.apiKey,
-    },
-  });
+  const cloned = req.clone({});
 
   return next(cloned);
killedBy: apiKeyInterceptor adds access_key param to weatherstack requests
statusReason: Error: Expected one matching request for criteria "Match by function: ", found none. Requests received are: GET http://api.weatherstack.com/current?query=42,21.
