[NoCoverage] BlockStatement
src/app/main/main.component.ts:26:27
   readonly #weatherService = inject(WeatherService);
   readonly vm = this.#weatherService.weather;
 
-  onLocationButtonClick() {
-    this.#weatherService.detectLocation();
-  }
+  onLocationButtonClick() {}
 
   onErrorMessageClick() {

[NoCoverage] BlockStatement
src/app/main/main.component.ts:30:25
     this.#weatherService.detectLocation();
   }
 
-  onErrorMessageClick() {
-    this.#weatherService.clearErrorMessage();
-  }
+  onErrorMessageClick() {}
 }
 
