[Survived] BooleanLiteral
app/main/weather-form/weather-form.component.ts:19:28
   imports: [MatProgressSpinnerModule],
 })
 export class WeatherFormComponent {
-  locationDetected = input(false, { transform: booleanAttribute });
+  locationDetected = input(true, { transform: booleanAttribute });
   error = input("");
   loading = input(false, { transform: booleanAttribute });

[Survived] BooleanLiteral
app/main/weather-form/weather-form.component.ts:21:19
 export class WeatherFormComponent {
   locationDetected = input(false, { transform: booleanAttribute });
   error = input("");
-  loading = input(false, { transform: booleanAttribute });
+  loading = input(true, { transform: booleanAttribute });
   locationDetectedMessage = input("");
 

[Survived] StringLiteral
app/main/weather-form/weather-form.component.ts:22:35
   locationDetected = input(false, { transform: booleanAttribute });
   error = input("");
   loading = input(false, { transform: booleanAttribute });
-  locationDetectedMessage = input("");
+  locationDetectedMessage = input("Stryker was here!");
 
   locationButtonClick = output();

[NoCoverage] BlockStatement
app/main/weather-form/weather-form.component.ts:27:27
   locationButtonClick = output();
   errorMessageClick = output();
 
-  onLocationButtonClick() {
-    this.locationButtonClick.emit();
-  }
+  onLocationButtonClick() {}
 
   onErrorMessageClick() {

[NoCoverage] BlockStatement
app/main/weather-form/weather-form.component.ts:31:25
     this.locationButtonClick.emit();
   }
 
-  onErrorMessageClick() {
-    this.errorMessageClick.emit();
-  }
+  onErrorMessageClick() {}
 }
 
