[Killed] ObjectLiteral
src/app/services/weather.service.ts:38:16
 
   readonly #state = signal<State>({
     api: {
-      current: {
-        cloudcover: 0,
-        feelslike: 0,
-        humidity: 0,
-        is_day: "",
-        observation_time: "",
-        precip: 0,
-        pressure: 0,
-        temperature: 0,
-        uv_index: 0,
-        visibility: 0,
-        weather_code: 0,
-        weather_descriptions: [],
-        weather_icons: [],
-        wind_degree: 0,
-        wind_dir: "",
-        wind_speed: 0,
-      },
+      current: {},
       location: {
         country: "",
killedBy: WeatherService should initialize default values
statusReason: Expected $.api.current to have properties
    cloudcover: 0
    feelslike: 0
    humidity: 0
    is_day: ''
    observation_time: ''
    precip: 0
    pressure: 0

[Killed] StringLiteral
src/app/services/weather.service.ts:42:17
         cloudcover: 0,
         feelslike: 0,
         humidity: 0,
-        is_day: "",
+        is_day: "Stryker was here!",
         observation_time: "",
         precip: 0,
killedBy: WeatherService should initialize default values
statusReason: Expected $.api.current.is_day = 'Stryker was here!' to equal ''.

[Killed] ArrayDeclaration
src/app/services/weather.service.ts:51:24
         visibility: 0,
         weather_code: 0,
         weather_descriptions: [],
-        weather_icons: [],
+        weather_icons: ["Stryker was here"],
         wind_degree: 0,
         wind_dir: "",
killedBy: WeatherService should initialize default values
statusReason: Expected $.api.current.weather_icons.length = 1 to equal 0.
Unexpected $.api.current.weather_icons[0] = 'Stryker was here' in array.

[Killed] BooleanLiteral
src/app/services/weather.service.ts:74:14
         unit: "",
       },
     },
-    loading: false,
+    loading: true,
     loaded: false,
     locationDetected: false,
killedBy: WeatherService should initialize default values
statusReason: Expected $.loading = true to equal false.

[Killed] BooleanLiteral
src/app/services/weather.service.ts:75:13
       },
     },
     loading: false,
-    loaded: false,
+    loaded: true,
     locationDetected: false,
     error: "",
killedBy: WeatherService should initialize default values
statusReason: Expected $.loaded = true to equal false.

[Killed] BooleanLiteral
src/app/services/weather.service.ts:76:23
     },
     loading: false,
     loaded: false,
-    locationDetected: false,
+    locationDetected: true,
     error: "",
   });
killedBy: MainComponent shows default detect location button text
statusReason: Expected ' Location detected! ' to contain 'Detect location'.

[Killed] BlockStatement
src/app/services/weather.service.ts:80:37
     error: "",
   });
 
-  readonly weather = computed(() => {
-    const state = this.#state();
-    return {
-      ...state,
-      locationDetectedMessage: state.locationDetected
-        ? "Location detected!"
-        : "Detect location",
-      locationWiki: state.api.location.name
-        ? `https://en.wikipedia.org/wiki/${state.api.location.name}`
-        : "",
-    };
-  });
+  readonly weather = computed(() => {});
 
   readonly #detectLocation$ = new Subject<void>();
killedBy: MainComponent shows default detect location button text; WeatherService should update error message on clearErrorMessage()
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] ObjectLiteral
src/app/services/weather.service.ts:82:12
 
   readonly weather = computed(() => {
     const state = this.#state();
-    return {
-      ...state,
-      locationDetectedMessage: state.locationDetected
-        ? "Location detected!"
-        : "Detect location",
-      locationWiki: state.api.location.name
-        ? `https://en.wikipedia.org/wiki/${state.api.location.name}`
-        : "",
-    };
+    return {};
   });
 
killedBy: MainComponent shows default detect location button text
statusReason: Expected '  ' to contain 'Detect location'.

[Killed] StringLiteral
src/app/services/weather.service.ts:86:11
       ...state,
       locationDetectedMessage: state.locationDetected
         ? "Location detected!"
-        : "Detect location",
+        : "",
       locationWiki: state.api.location.name
         ? `https://en.wikipedia.org/wiki/${state.api.location.name}`
killedBy: MainComponent shows default detect location button text
statusReason: Expected '  ' to contain 'Detect location'.

[Killed] StringLiteral
src/app/services/weather.service.ts:88:11
         ? "Location detected!"
         : "Detect location",
       locationWiki: state.api.location.name
-        ? `https://en.wikipedia.org/wiki/${state.api.location.name}`
+        ? ``
         : "",
     };
killedBy: WeatherService should detect location and fetch weather data
statusReason: Expected '' to be 'https://en.wikipedia.org/wiki/Belgrade'.

[Killed] BlockStatement
src/app/services/weather.service.ts:95:17
 
   readonly #detectLocation$ = new Subject<void>();
 
-  constructor() {
-    this.#detectLocation$
-      .pipe(
-        switchMap(() => this.#getCurrentPosition$()),
-        switchMap((q) => this.#getCurrentWeather(q)),
-        takeUntilDestroyed(),
-      )
-      .subscribe();
-
-    effect(() => {
-      this.#changeBackground(this.#state().api.current.is_day);
-    });
-  }
+  constructor() {}
 
   #getCurrentPosition$() {
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Error: Expected one matching request for criteria "Match by function: ", found none.

[Survived] BlockStatement
src/app/services/weather.service.ts:104:18
       )
       .subscribe();
 
-    effect(() => {
-      this.#changeBackground(this.#state().api.current.is_day);
-    });
+    effect(() => {});
   }
 

[Killed] BlockStatement
src/app/services/weather.service.ts:110:49
   }
 
   #getCurrentPosition$() {
-    return new Observable<string>((observer) => {
-      if (!navigator.geolocation) {
-        this.#updateState({
-          error: "Geolocation not supported",
-          locationDetected: false,
-        });
-        observer.complete();
-        return;
-      }
-
-      navigator.geolocation.getCurrentPosition(
-        (position) => {
-          const q = `${position.coords.latitude},${position.coords.longitude}`;
-          this.#updateState({ locationDetected: true, loading: true });
-          observer.next(q);
-          observer.complete();
-        },
-        (error) => {
-          this.#updateState({ error: error.message, locationDetected: false });
-          observer.complete();
-        },
-        { enableHighAccuracy: true },
-      );
-    });
+    return new Observable<string>((observer) => {});
   }
 
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected '' to be 'Permission denied'.

[Killed] ConditionalExpression
src/app/services/weather.service.ts:111:11
 
   #getCurrentPosition$() {
     return new Observable<string>((observer) => {
-      if (!navigator.geolocation) {
+      if (true) {
         this.#updateState({
           error: "Geolocation not supported",
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected 'Geolocation not supported' to be 'Permission denied'.

[Killed] BooleanLiteral
src/app/services/weather.service.ts:111:11
 
   #getCurrentPosition$() {
     return new Observable<string>((observer) => {
-      if (!navigator.geolocation) {
+      if (navigator.geolocation) {
         this.#updateState({
           error: "Geolocation not supported",
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Error: Expected one matching request for criteria "Match by function: ", found none.

[NoCoverage] BooleanLiteral
src/app/services/weather.service.ts:114:29
       if (!navigator.geolocation) {
         this.#updateState({
           error: "Geolocation not supported",
-          locationDetected: false,
+          locationDetected: true,
         });
         observer.complete();

[Survived] BlockStatement
src/app/services/weather.service.ts:121:23
       }
 
       navigator.geolocation.getCurrentPosition(
-        (position) => {
-          const q = `${position.coords.latitude},${position.coords.longitude}`;
-          this.#updateState({ locationDetected: true, loading: true });
-          observer.next(q);
-          observer.complete();
-        },
+        (position) => {},
         (error) => {
           this.#updateState({ error: error.message, locationDetected: false });

[Killed] BooleanLiteral
src/app/services/weather.service.ts:123:49
       navigator.geolocation.getCurrentPosition(
         (position) => {
           const q = `${position.coords.latitude},${position.coords.longitude}`;
-          this.#updateState({ locationDetected: true, loading: true });
+          this.#updateState({ locationDetected: false, loading: true });
           observer.next(q);
           observer.complete();
killedBy: WeatherService should detect location and fetch weather data
statusReason: Expected false to be true.

[Survived] BooleanLiteral
src/app/services/weather.service.ts:123:64
       navigator.geolocation.getCurrentPosition(
         (position) => {
           const q = `${position.coords.latitude},${position.coords.longitude}`;
-          this.#updateState({ locationDetected: true, loading: true });
+          this.#updateState({ locationDetected: true, loading: false });
           observer.next(q);
           observer.complete();

[Killed] BlockStatement
src/app/services/weather.service.ts:127:20
           observer.next(q);
           observer.complete();
         },
-        (error) => {
-          this.#updateState({ error: error.message, locationDetected: false });
-          observer.complete();
-        },
+        (error) => {},
         { enableHighAccuracy: true },
       );
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected '' to be 'Permission denied'.

[Survived] BooleanLiteral
src/app/services/weather.service.ts:128:71
           observer.complete();
         },
         (error) => {
-          this.#updateState({ error: error.message, locationDetected: false });
+          this.#updateState({ error: error.message, locationDetected: true });
           observer.complete();
         },

[Survived] BooleanLiteral
src/app/services/weather.service.ts:131:31
           this.#updateState({ error: error.message, locationDetected: false });
           observer.complete();
         },
-        { enableHighAccuracy: true },
+        { enableHighAccuracy: false },
       );
     });

[Killed] BlockStatement
src/app/services/weather.service.ts:136:20
     });
   }
 
-  detectLocation() {
-    this.#detectLocation$.next();
-  }
+  detectLocation() {}
 
   clearErrorMessage() {
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Error: Expected one matching request for criteria "Match by function: ", found none.

[Killed] BlockStatement
src/app/services/weather.service.ts:140:23
     this.#detectLocation$.next();
   }
 
-  clearErrorMessage() {
-    this.#updateState({ error: "", locationDetected: false });
-  }
+  clearErrorMessage() {}
 
   #getCurrentWeather(q: string) {
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected 'Permission denied' to be ''.

[Killed] BooleanLiteral
src/app/services/weather.service.ts:141:54
   }
 
   clearErrorMessage() {
-    this.#updateState({ error: "", locationDetected: false });
+    this.#updateState({ error: "", locationDetected: true });
   }
 
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected true to be false.

[Survived] BlockStatement
src/app/services/weather.service.ts:144:33
     this.#updateState({ error: "", locationDetected: false });
   }
 
-  #getCurrentWeather(q: string) {
-    const params = new HttpParams().set("query", q);
-
-    this.#updateState({ loading: true });
-
-    return this.#http.get<API>(this.#currentUrl, { params }).pipe(
-      tap((api) => {
-        this.#updateState({ api, loaded: true });
-      }),
-      finalize(() => {
-        this.#updateState({ loading: false });
-      }),
-    );
-  }
+  #getCurrentWeather(q: string) {}
 
   #changeBackground(isDay: API["current"]["is_day"]) {

[Survived] BooleanLiteral
src/app/services/weather.service.ts:147:34
   #getCurrentWeather(q: string) {
     const params = new HttpParams().set("query", q);
 
-    this.#updateState({ loading: true });
+    this.#updateState({ loading: false });
 
     return this.#http.get<API>(this.#currentUrl, { params }).pipe(

[Survived] ObjectLiteral
src/app/services/weather.service.ts:147:23
   #getCurrentWeather(q: string) {
     const params = new HttpParams().set("query", q);
 
-    this.#updateState({ loading: true });
+    this.#updateState({});
 
     return this.#http.get<API>(this.#currentUrl, { params }).pipe(

[Survived] BlockStatement
src/app/services/weather.service.ts:150:20
     this.#updateState({ loading: true });
 
     return this.#http.get<API>(this.#currentUrl, { params }).pipe(
-      tap((api) => {
-        this.#updateState({ api, loaded: true });
-      }),
+      tap((api) => {}),
       finalize(() => {
         this.#updateState({ loading: false });

[Killed] BooleanLiteral
src/app/services/weather.service.ts:151:42
 
     return this.#http.get<API>(this.#currentUrl, { params }).pipe(
       tap((api) => {
-        this.#updateState({ api, loaded: true });
+        this.#updateState({ api, loaded: false });
       }),
       finalize(() => {
killedBy: WeatherService should detect location and fetch weather data
statusReason: Expected false to be true.

[Survived] BlockStatement
src/app/services/weather.service.ts:153:22
       tap((api) => {
         this.#updateState({ api, loaded: true });
       }),
-      finalize(() => {
-        this.#updateState({ loading: false });
-      }),
+      finalize(() => {}),
     );
   }

[Survived] BooleanLiteral
src/app/services/weather.service.ts:154:38
         this.#updateState({ api, loaded: true });
       }),
       finalize(() => {
-        this.#updateState({ loading: false });
+        this.#updateState({ loading: true });
       }),
     );

[Survived] ObjectLiteral
src/app/services/weather.service.ts:154:27
         this.#updateState({ api, loaded: true });
       }),
       finalize(() => {
-        this.#updateState({ loading: false });
+        this.#updateState({});
       }),
     );

[Survived] BlockStatement
src/app/services/weather.service.ts:159:54
     );
   }
 
-  #changeBackground(isDay: API["current"]["is_day"]) {
-    if (!isDay) {
-      return;
-    }
-
-    if (isDay !== "no") {
-      this.#renderer.setStyle(
-        this.#body,
-        "background-image",
-        'url("assets/day.png")',
-      );
-      return this.#renderer.setStyle(this.#body, "color", "#000");
-    }
-
-    if (isDay === "no") {
-      this.#renderer.setStyle(
-        this.#body,
-        "background-image",
-        'url("assets/night.png")',
-      );
-      return this.#renderer.setStyle(this.#body, "color", "#000");
-    }
-  }
+  #changeBackground(isDay: API["current"]["is_day"]) {}
 
   #updateState(patch: Partial<State>) {

[Survived] BooleanLiteral
src/app/services/weather.service.ts:160:9
   }
 
   #changeBackground(isDay: API["current"]["is_day"]) {
-    if (!isDay) {
+    if (isDay) {
       return;
     }

[Survived] ConditionalExpression
src/app/services/weather.service.ts:160:9
   }
 
   #changeBackground(isDay: API["current"]["is_day"]) {
-    if (!isDay) {
+    if (false) {
       return;
     }

[Survived] BlockStatement
src/app/services/weather.service.ts:164:25
       return;
     }
 
-    if (isDay !== "no") {
-      this.#renderer.setStyle(
-        this.#body,
-        "background-image",
-        'url("assets/day.png")',
-      );
-      return this.#renderer.setStyle(this.#body, "color", "#000");
-    }
+    if (isDay !== "no") {}
 
     if (isDay === "no") {

[Survived] ConditionalExpression
src/app/services/weather.service.ts:164:9
       return;
     }
 
-    if (isDay !== "no") {
+    if (false) {
       this.#renderer.setStyle(
         this.#body,

[NoCoverage] ConditionalExpression
src/app/services/weather.service.ts:173:9
       return this.#renderer.setStyle(this.#body, "color", "#000");
     }
 
-    if (isDay === "no") {
+    if (true) {
       this.#renderer.setStyle(
         this.#body,

[NoCoverage] EqualityOperator
src/app/services/weather.service.ts:173:9
       return this.#renderer.setStyle(this.#body, "color", "#000");
     }
 
-    if (isDay === "no") {
+    if (isDay !== "no") {
       this.#renderer.setStyle(
         this.#body,

[Killed] BlockStatement
src/app/services/weather.service.ts:183:39
     }
   }
 
-  #updateState(patch: Partial<State>) {
-    this.#state.update((state) => ({ ...state, ...patch }));
-  }
+  #updateState(patch: Partial<State>) {}
 }
 
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: Expected '' to be 'Serbia'.

[Killed] ArrowFunction
src/app/services/weather.service.ts:184:24
   }
 
   #updateState(patch: Partial<State>) {
-    this.#state.update((state) => ({ ...state, ...patch }));
+    this.#state.update(() => undefined);
   }
 }
killedBy: WeatherService should update error message on clearErrorMessage()
statusReason: TypeError: Cannot read properties of undefined (reading 'locationDetected')
